Examinator/src/Catalogs/ЗаданияСУО/ЗаданияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаданияСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КаталогМероприятийСУО</owners>
  <owners>Catalog.Пользователи</owners>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначимостьОценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраницВопросов</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьСтраницыВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтандартныеНастройкиТеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокВыполненияЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВБиблиотеку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВБиблиотеке</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДополнительныеМатериалы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодВыбораПопыткиПрохождения</name>
    <type>
      <types>EnumRef.МетодВыбораПопыткиПрохожденияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательВыставляетОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПрикреплениеФайлаКОтвету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЖдатьПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/УчебныеМатериалыСУО/УчебныеМатериалыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеМатериалыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Хранение</name>
    <type>
      <types>DefinedType.УчебныйМатериалСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыУчебныхМатериаловСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Размещение</name>
    <type>
      <types>EnumRef.РазмещениеУчебныхМатериаловСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ЗаданияСУО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;		
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяФорматированныйДокумент Тогда
		Описание = "";
		ФорматированныйДокументОписания = ОписаниеФорматированныйДокумент.Получить();
		Если ТипЗнч(ФорматированныйДокументОписания) = Тип("ФорматированныйДокумент") Тогда
			Описание = ФорматированныйДокументОписания.ПолучитьТекст();
		КонецЕсли;
	Иначе
		ОписаниеФорматированныйДокумент = Неопределено;
	КонецЕсли;		
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	
	КонтекстРедактирования = Неопределено;
	ДополнительныеСвойства.Свойство("КонтекстРедактирования", КонтекстРедактирования);
	Справочники.УчебныеМатериалыСУО.ПриЗаписиМатериала(Ссылка, КонтекстРедактирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа
		И НаОсновеЭлектронногоРесурса
		И НЕ НесколькоВариантов Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
			Текст = НСтр("ru = 'Заполните поле ""Электронный ресурс""'");
			Поле = "ЭлектронныйРесурс";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
